/**
 * package-info: 设计模式 for learning
 * Erich Gamma，Richard Helm，Ralph Johnson和John Vlissides 《设计模式 - 可重用的面向对象软件元素》
 *
 - 项目内容：
 - 6大原则 package: principle
 1. 单一职责原则 -- 类
 2. 里氏替换原则 -- 继承
 3. 依赖倒置原则 -- 接口 分层
 4. 接口隔离原则 -- 接口 冗余
 5. 迪米特法则 -- 耦合
 6. 开闭原则 -- 修改&扩展

 - 创建模型 package: creator
 1. 单例模式 -- 单个对象
 2. 工厂方法模式 -- 多个对象 ?
 3. 抽象工厂模式 -- 多对象组 ?
 4. 建造者模式 -- 组装对象 ?
 5. 原型模式 -- clone()

 - 行为模式 package: behavior
 1. 模板方法模式  -- 钩子方法 (抽象规则,操作延迟到子类)
 2. 中介者模式 -- 散射模型 (???)
 3. 观察者模式 -- 监听者模式 联动 (一动则都动)
 4. 访问者模式 -- 方法外置 (易变动作封装到访问者中)
 5. 命令模式 -- 响应模型 ？
 6. 责任链模式 -- 分级处理
 7. 策略模式 -- 策略调用统一?
 8. 迭代器模式 -- 封装遍历
 9. 解释模式 -- 解析执行 ？
 10. 备忘录模式 -- 日志记录
 11. 状态模式 -- 依赖联动 ？

 - 结构型模式 package: structure
 1. 适配器模式 -- 兼容接口
 2. 桥接模式 -- 抽象/现实 ？
 3. 组合模式 -- 整体部分操作统一
 4. 装饰模式 -- 对象增方法
 5. 外观模式 -- 用户来看
 6. 享元模式 -- 共享
 7. 代理模式 -- 代理类
 *
 * author: Chengjs, version:1.0.0, 2017-09-08
 */
